src/DataProcessors/ПереносЗаказовПоставщикамВЗаявкиОтПокупателей1C8/ПереносЗаказовПоставщикамВЗаявкиОтПокупателей1C8.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносЗаказовПоставщикамВЗаявкиОтПокупателей1C8</name>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДанными</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаОтПокупателя/ЗаявкаОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаОтПокупателя</name>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дополнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэфф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ОсновныеЕдиницыИзмерений/ОсновныеЕдиницыИзмерений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеЕдиницыИзмерений</name>
  <comment>Основные единицы измерений</comment>
  <owners>Catalog.Материалы</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета количества</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПереносЗаказовПоставщикамВЗаявкиОтПокупателей1C8/Forms/Форма/Module.bsl
&НаСервере
Функция СоздатьЗаявкуОтПокупателя(НомерЗаказа,ДатаДокумента,Дополнение,Комментарий)
	Попытка
	ЗаявкаОтПокупателя = Документы.ЗаявкаОтПокупателя.СоздатьДокумент();
	ЗаявкаОтПокупателя.Номер = НомерЗаказа;
	//ЗаявкаОтПокупателя.Подразделение = Подразделение;
	ЗаявкаОтПокупателя.Автор = ПараметрыСеанса.Пользователь;
	ЗаявкаОтПокупателя.Дата = ДатаДокумента;
	//ЗаявкаОтПокупателя.ДатаИсполнения = ДатаИсполнения;
	ЗаявкаОтПокупателя.Контрагент = Контрагент;
	ЗаявкаОтПокупателя.Договор = Контрагент.ОсновнойДоговор;
	ЗаявкаОтПокупателя.Курс = 1;
	ЗаявкаОтПокупателя.Коэфф = 1;
	ЗаявкаОтПокупателя.Дополнение = Дополнение;
	ЗаявкаОтПокупателя.Комментарий = Комментарий;
		Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
		ТЧ = ЗаявкаОтПокупателя.ТабличнаяЧасть.Добавить();
			Если ТипЗнч(ТЧ_МПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			Иначе	
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			КонецЕсли;		
		ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
		ТЧ.Количество = ТЧ_МПЗ.Количество;
		ТЧ.ЕдиницаИзмерения = ТЧ_МПЗ.ЕдиницаИзмерения;
		ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ТЧ_МПЗ.МПЗ,ТекущаяДата())*ТЧ_МПЗ.ЕдиницаИзмерения.Коэффициент;
			Если ТЧ.Цена = 0 Тогда
			ТЧ.Цена = 1;			
			КонецЕсли; 
		ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
			Если Контрагент.ОсновнойДоговор.БезНДС Тогда
			ТЧ.Всего = ТЧ.Сумма;
			Иначе	
			ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС;
			ТЧ.НДС = ТЧ.Сумма*18/100;				
			ТЧ.Всего = ТЧ.Сумма +  ТЧ.НДС;			
			КонецЕсли; 
		КонецЦикла; 
			Если ЗаявкаОтПокупателя.ТабличнаяЧасть.Количество() > 0 Тогда
			ЗаявкаОтПокупателя.Записать(РежимЗаписиДокумента.Запись);
			Иначе
			Сообщить("Табличная часть документа пустая! Заявка от покупателя "+НомерЗаказа+" не создана!");
			Возврат(Документы.ЗаявкаОтПокупателя.ПустаяСсылка());
			КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Документы.ЗаявкаОтПокупателя.ПустаяСсылка());
	КонецПопытки;
Возврат(ЗаявкаОтПокупателя.Ссылка);
КонецФункции 

&НаСервере
Процедура ПроверитьНаСервере()
ТаблицаЗаказов.Очистить();
БазаХарькова = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Объект.ОбменДанными);
	Если БазаХарькова = Неопределено Тогда
	Сообщить("Не открыто соединение с производственной базой Харькова!");
	Возврат;
	КонецЕсли;
Выборка = БазаХарькова.Документы.ЗаказПоставщику.Выбрать(Объект.Период.ДатаНачала,Объект.Период.ДатаОкончания);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проведен Тогда
			Если СписокПодразделений.НайтиПоЗначению(СокрЛП(Выборка.Подразделение.Наименование)) <> Неопределено Тогда
			ТЧ = ТаблицаЗаказов.Добавить();
			ТЧ.НомерЗаказа = Выборка.Номер;
			ТЧ.ДатаЗаказа = Выборка.Дата;
			ТЧ.Дополнение = Выборка.Дополнение; 
			ТЧ.Комментарий = Выборка.Комментарий;
			ТЧ.Ссылка = Документы.ЗаявкаОтПокупателя.НайтиПоНомеру(Выборка.Номер,Выборка.Дата);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда) 
Состояние("Обработка...",,"Проверка заказов поставщику...");
ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерения(МПЗ,ЕдиницаИзмерения)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ОсновныеЕдиницыИзмерений КАК ОсновныеЕдиницыИзмерений
	|ГДЕ	
	|	ОсновныеЕдиницыИзмерений.Владелец = &Владелец
	|	И ОсновныеЕдиницыИзмерений.ЕдиницаИзмерения.Наименование = &Наименование";
Запрос.УстановитьПараметр("Владелец", МПЗ);
Запрос.УстановитьПараметр("Наименование", СокрЛП(ЕдиницаИзмерения));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Справочники.ОсновныеЕдиницыИзмерений.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ДобавитьМПЗ(ВидМПЗ,Наименование,Количество,ЕдиницаИзмерения)
	Если ВидМПЗ = 0 Тогда
	МПЗ = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Иначе	
	МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	КонецЕсли;
		Если Не МПЗ.Пустая() Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МПЗ = МПЗ;
		ТЧ.Количество = Количество;	
		ТЧ.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(МПЗ,ЕдиницаИзмерения);
		Возврат(Истина);
		Иначе
		Сообщить(Наименование+" - не найден в справочнике!");  
		Возврат(Ложь);
		КонецЕсли;
КонецФункции

&НаСервере
Процедура ПеренестиНаСервере()
БазаХарькова = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Объект.ОбменДанными);
	Если БазаХарькова = Неопределено Тогда
	Сообщить("Не открыто соединение с производственной базой Харькова!");
	Возврат;
	КонецЕсли;	
		Для каждого ТЧ Из ТаблицаЗаказов Цикл
			Если ТЧ.Пометка Тогда
				Если Не ТЧ.Ссылка.Пустая() Тогда
				Продолжить;
				КонецЕсли;
			Док = БазаХарькова.Документы.ЗаказПоставщику.НайтиПоНомеру(ТЧ.НомерЗаказа,ТЧ.ДатаЗаказа);
				Если Док <> БазаХарькова.Документы.ЗаказПоставщику.ПустаяСсылка() Тогда
				ТаблицаМПЗ.Очистить();
				флНеНайден = Ложь;
					Для каждого ТЧ_МПЗ Из Док.ТабличнаяЧасть Цикл	
					ВидМПЗ = БазаХарькова.Перечисления.ВидыМПЗ.Индекс(ТЧ_МПЗ.ВидМПЗ);
						Если Не ДобавитьМПЗ(ВидМПЗ,СокрЛП(ТЧ_МПЗ.МПЗ.Наименование),ТЧ_МПЗ.Количество,ТЧ_МПЗ.ЕдиницаИзмерения.Наименование) Тогда	
						флНеНайден = Истина;
						КонецЕсли;				
					КонецЦикла; 
						Если Не флНеНайден Тогда
						ТЧ.Ссылка = СоздатьЗаявкуОтПокупателя(ТЧ.НомерЗаказа,ТЧ.ДатаЗаказа,ТЧ.Дополнение,ТЧ.Комментарий);
						Иначе
						Сообщить(ТЧ.НомерЗаказа+" - документ не перенесён!");			
						КонецЕсли;			
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
Состояние("Обработка...",,"Перенос выбранных заказов поставщику...");
ПеренестиНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаЗаказов Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаЗаказов Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
